pfm/tutorials/multiphase/MagnificationLensSolver/UnboundedFluidizationCases/0p20/CFD/0/U.particles
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "1";
    object      U.particles;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   nonuniform List<vector> 
131072
(
(0.050021312 0.037446938 0.016511226)
(-0.021994354 -0.017196873 0.051997031)
(-0.056988149 -0.020911837 0.080528528)
(-0.038090437 -0.01436188 0.14442639)
(-0.041200194 0.02602169 0.16479574)
(-0.042074259 0.03075934 0.20774699)
(-0.043579998 -0.0043097513 0.24100391)
(-0.039335632 -0.040652392 0.25540807)
...
)
;

boundaryField
{
    bottom
    {
        type            cyclic;
    }
    top
    {
        type            cyclic;
    }
    lr1
    {
        type            cyclic;
    }
    lr2
    {
        type            cyclic;
    }
    vh1
    {
        type            cyclic;
    }
    vh2
    {
        type            cyclic;
    }
    magLens_top_master
    {
        type            cyclic;
    }
    magLens_top_slave
    {
        type            cyclic;
    }
    magLens_bottom_master
    {
        type            cyclic;
    }
    magLens_bottom_slave
    {
        type            cyclic;
    }
}


// ************************************************************************* //
