pfm/tutorials/multiphase/MagnificationLensSolver/UnboundedFluidizationCases/0p20/CFD/0/alpha.air
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "1";
    object      alpha.air;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   nonuniform List<scalar> 
131072
(
0.72624256
0.77758922
0.88130323
0.91105004
0.91152335
0.91789079
0.94774901
0.98020427
...
)
;

boundaryField
{
    bottom
    {
        type            cyclic;
    }
    top
    {
        type            cyclic;
    }
    lr1
    {
        type            cyclic;
    }
    lr2
    {
        type            cyclic;
    }
    vh1
    {
        type            cyclic;
    }
    vh2
    {
        type            cyclic;
    }
    magLens_top_master
    {
        type            cyclic;
    }
    magLens_top_slave
    {
        type            cyclic;
    }
    magLens_bottom_master
    {
        type            cyclic;
    }
    magLens_bottom_slave
    {
        type            cyclic;
    }
}


// ************************************************************************* //
