pfm/tutorials/multiphase/MagnificationLensSolver/UnboundedFluidizationCases/0p20/CFD/constant/magnificationLensDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      magnificationLensDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

simulationType magnificationLens;
// specify the number of time steps which after the magnification lens coupling should start!
startTimeStep 2000;

// specify the solids volume fraction of the cells based on discrete particles where momentum 
// coupling should occur!
solidsVolFracThresh 0;

// Switch for activating postprocessing calculations (e.g., slip velocity, TKEs, etc.) in periodic box simulations
periodicCalculations true;

// specify the type of magnification lens simulation
// momentumCoupling = both mass and momentum source terms are considered
// momentumCoupling = only momentum source term is considered
// oneWayCoupling = no coupling happens between TFM and CFD-DEM
magnificationLens
{

   magnificationLensModel     momentumCoupling; //massMomentumCoupling //oneWayCoupling

}

// ************************************************************************* //
